nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/coex_examples/coex_wifi_edgefast/pin_mux.h
/* GPIO_EMC_B1_40 (coord V2), ENET_MDC */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_MDC_PERIPHERAL                        ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_MDC_SIGNAL                           enet_mdc   /*!< Signal name */

/* GPIO_AD_14 (coord R25), ETH0_INT_B */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_PERIPHERAL                        GPIO9   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_CHANNEL                             13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_GPIO                              GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_GPIO_PIN                            13U   /*!< GPIO pin number */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_GPIO_PIN_MASK               (1U << 13U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET_1GPins(void);             /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_41 (coord U3), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_MDIO_PERIPHERAL                      ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_MDIO_SIGNAL                        enet_mdio   /*!< Signal name */

/* GPIO_EMC_B1_40 (coord V2), ENET_MDC */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_MDC_PERIPHERAL                       ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_MDC_SIGNAL                          enet_mdc   /*!< Signal name */

/* GPIO_DISP_B2_04 (coord A11), ENET_QOS_TXEN */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXEN_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXEN_SIGNAL                   enet_tx_en   /*!< Signal name */

/* GPIO_EMC_B2_20 (number AE7), ENET_QOS_REF_CLK1 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_REF_CLK1_PERIPHERAL             ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_REF_CLK1_SIGNAL             enet_ref_clk   /*!< Signal name */

/* GPIO_DISP_B2_02 (coord C15), ENET_QOS_TXD0 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD0_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD0_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B2_03 (coord F11), ENET_QOS_TXD1 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD1_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD1_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD1_CHANNEL                          1U   /*!< Signal channel */

/* GPIO_DISP_B2_08 (coord C9), ENET_QOS_CRS_DV */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_CRS_DV_PERIPHERAL               ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_CRS_DV_SIGNAL                 enet_rx_en   /*!< Signal name */

/* GPIO_DISP_B2_06 (coord A9), ENET_QOS_RXD0 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD0_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD0_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B2_07 (coord B8), ENET_QOS_RXD1 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD1_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD1_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD1_CHANNEL                          1U   /*!< Signal channel */

/* GPIO_DISP_B2_09 (coord C13), ENET_QOS_RXER */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXER_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXER_SIGNAL                   enet_rx_er   /*!< Signal name */

/* GPIO_DISP_B2_11 (coord G11), ENET_QOS_INT_B */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_PERIPHERAL                  GPIO11   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_CHANNEL                        12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_GPIO                        GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_GPIO_PIN                       12U   /*!< GPIO pin number */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_GPIO_PIN_MASK          (1U << 12U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET_QOSPins(void);            /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_I2CPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_I2SPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_PWMPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_SPIPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_UARTPins(void);         /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);                 /* Function assigned for the Cortex-M7F */

#define BOARD_INITSPIPINS_DEINIT_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x7800U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitSPIPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitSPIPins_deinit(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGPTPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitKPPPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);                 /* Function assigned for the Cortex-M7F */

#define BOARD_INITI2CPINS_DEINIT_IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK 0x0180U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitI2CPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitI2CPins_deinit(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLASHPins(void);               /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitALT_UARTPins(void);            /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWMPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQTMRPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_39 (coord T2), LED */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_PERIPHERAL                                  GPIO8   /*!< Peripheral name */
#define BOARD_INITLEDSPINS_LED_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITLEDSPINS_LED_CHANNEL                                        7U   /*!< Signal channel */

